# Welcome to the Data Manipulation Exercises

The workbook has been broken up into three sections.  Each section correlates to a reading assignment within the textbook.

In [126]:
import pandas as pd
import numpy as np

data= pd.read_csv("titanic.csv")

## Before You Get Started

We are going to be using the Titanic Dataset. Make sure to run a head() before you start working with manipulation methods.

In [127]:
# Run the head of your data set here:
data.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [128]:
# check for duplicates
data.duplicated().sum()

np.int64(107)

In [129]:
# if there are, go ahead and drop them:
data.drop_duplicates()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
885,0,3,female,39.0,0,5,29.1250,Q,Third,woman,False,NaN,Queenstown,no,False
887,1,1,female,19.0,0,0,30.0000,S,First,woman,False,B,Southampton,yes,True
888,0,3,female,NaN,1,2,23.4500,S,Third,woman,False,NaN,Southampton,no,False
889,1,1,male,26.0,0,0,30.0000,C,First,man,True,C,Cherbourg,yes,True
890,0,3,male,32.0,0,0,7.7500,Q,Third,man,True,NaN,Queenstown,no,True

### Cleaning Note:

While the columns are not the "prettiest", don't adjust any of them yet. We are going to update some values and add some values as we work through this notebook. Apologies for the extra visual "noise" on your screen. You will be given the option to tidy up the columns at the end of this notebook.

## Running Tables Note:  
If your tables don't appear to have accepted your changes, try the "Run All" option in the "Cell" section of the menu bar.

<span style="background-color:dodgerblue; color:dodgerblue;">- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -</span>

# A. Aggregation

1. Work through the section Exercises.  
    - There are 4 sections in part A:
        - Groupby
        - Aggregation Methods
        - Groupby and Basic Math
        - Groupby and Multiple Aggregations

#### Creating Variables.

As we begin to manipulate our data, create new variables to store your work in.  This will keep your original data intact.  Having the original dataset available will save you time with each manipulation.  You can also create variable names that inform you of the purpose of the manipulation.

### 1: Groupby <span style="color:dodgerblue;"> - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - </span>

#### Groupby "embark_town"

1. Using the titanic data set, groupby "embark_town".
1. Create a variable that will represent the grouping of data.
1. Initialize it using the groupby() function and pass it the column.

In [159]:
# Code your groupby "embark_town" here:
grouped_embark = data.groupby("embark_town")

In [160]:
# To view the grouped data as a table, use the variable_name.first():
grouped_embark.first()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,alive,alone
embark_town,,,,,,,,,,,,,,
Cherbourg,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,yes,False
Queenstown,0,3,male,2.0,0,0,8.4583,Q,Third,man,True,C,no,True
Southampton,0,3,male,22.0,1,0,7.2500,S,Third,man,True,C,no,False

#### Groupby "survived"

Did you know that you can also chain on some of our exploratory methods to the groupby method?

1. Create & initalize a new variable to hold a table that will groupby "survived" 
1. Use method chaining to tack on the describe method

In [161]:
# Code your groupby "survived" table here:
grouped_survived = data.groupby("survived")

# run your table below:
grouped_survived.first()

,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
survived,,,,,,,,,,,,,,
0,3,male,22.0,1,0,7.2500,S,Third,man,True,E,Southampton,no,False
1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False

In [162]:
# run your table with describe
grouped_survived.describe()

         pclass                                                 age  \
          count      mean       std  min  25%  50%  75%  max  count
survived
0         549.0  2.531876  0.735805  1.0  2.0  3.0  3.0  3.0  424.0
1         342.0  1.950292  0.863321  1.0  1.0  2.0  3.0  3.0  290.0

                     ... parch        fare                             \
               mean  ...   75%  max  count       mean        std  min
survived             ...
0         30.626179  ...   0.0  6.0  549.0  22.117887  31.388207  0.0
1         28.343690  ...   1.0  5.0  342.0  48.395408  66.596998  0.0


              25%   50%   75%       max
survived
0          7.8542  10.5  26.0  263.0000
1         12.4750  26.0  57.0  512.3292

[2 rows x 40 columns]

In [ ]:
# How is this table organized?  Why are there 40 columns now?
#This table is giving me summary statistics per column that contains numeric values, so if we have psclass, age, sibsp, parch and fare
#it will give me 8 statistics per column, that will be 40 columns at the end

### 2. Aggregation Methods <span style="color:dodgerblue;"> - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - </span>

Note: **agg()** and **aggregate()** are identical [source](https://pandas.pydata.org/docs/reference/api/pandas.DataFrame.aggregate.html)

#### Method Chaining

1. Create a variable to apply **agg()** to your grouped data.
1. Pass one of the following statistical values to **agg()**
   - "mean", "median", "mode", "min", "max", "std", "var", "first", "last", "sum"

In [186]:
# Code your method chain here:
grouped_fare = data.groupby("fare")
grouped_fare[data.select_dtypes(include="number").columns].agg("mean")

          survived    pclass        age  sibsp     parch      fare
fare
0.0000    0.066667  1.933333  35.142857   0.00  0.000000    0.0000
4.0125    0.000000  3.000000  20.000000   0.00  0.000000    4.0125
5.0000    0.000000  1.000000  33.000000   0.00  0.000000    5.0000
6.2375    0.000000  3.000000  61.000000   0.00  0.000000    6.2375
6.4375    0.000000  3.000000  34.500000   0.00  0.000000    6.4375
...            ...       ...        ...    ...       ...       ...
227.5250  0.750000  1.000000  32.666667   0.25  0.000000  227.5250
247.5208  0.500000  1.000000  37.000000   0.00  1.000000  247.5208
262.3750  1.000000  1.000000  19.500000   2.00  2.000000  262.3750
263.0000  0.500000  1.000000  32.500000   2.50  2.500000  263.0000
512.3292  1.000000  1.000000  35.333333   0.00  0.333333  512.3292

[248 rows x 6 columns]

In [198]:
# Create a variable to apply agg("sum") to your grouped data
grouped_variables = data.groupby(["age", "parch", "fare"]).sum()

# run your table:
print(grouped_variables)

                     survived  pclass           sex  sibsp embarked  \
age   parch fare
0.42  1     8.5167          1       3          male      0        C
0.67  1     14.5000         1       2          male      1        S
0.75  1     19.2583         2       6  femalefemale      4       CC
0.83  1     18.7500         1       2          male      1        S
      2     29.0000         1       2          male      0        S
...                       ...     ...           ...    ...      ...
70.50 0     7.7500          0       3          male      0        Q
71.00 0     34.6542         0       1          male      0        C
            49.5042         0       1          male      0        C
74.00 0     7.7750          0       3          male      0        S
80.00 0     30.0000         1       1          male      0        S

                          class         who  adult_male deck  \
age   parch fare
0.42  1     8.5167        Third       child           0    0
0.67  1     14.5000      Second       child           0    0
0.75  1     19.2583  ThirdThird  childchild           0    0
0.83  1     18.7500      Second       child           0    0
      2     29.0000      Second       child           0    0
...                         ...         ...         ...  ...
70.50 0     7.7500        Third         man           1    0
71.00 0     34.6542       First         man           1    A
            49.5042       First         man           1    0
74.00 0     7.7750        Third         man           1    0
80.00 0     30.0000       First         man           1    A

                            embark_town   alive  alone
age   parch fare
0.42  1     8.5167            Cherbourg     yes      0
0.67  1     14.5000         Southampton     yes      0
0.75  1     19.2583  CherbourgCherbourg  yesyes      0
0.83  1     18.7500         Southampton     yes      0
      2     29.0000         Southampton     yes      0
...                                 ...     ...    ...
70.50 0     7.7500           Queenstown      no      1
71.00 0     34.6542           Cherbourg      no      1
            49.5042           Cherbourg      no      1
74.00 0     7.7750          Southampton      no      1
80.00 0     30.0000         Southampton     yes      1

[640 rows x 12 columns]

In [ ]:
# Explain the sum table.  What is going on with the "sex", "class", and "alive" columns?

#### Using a Dictionary <span style="color:darkorange;"> - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - </span> 
##### A dictionary is a Python collection type.  

Is a collection type that stores **key-value pairs**.  A key-value pair is an organization system that is made up of a single *key* that has one or more *values* paired with it.  
Think of it like your contacts list.  The contacts list is the dictionary object.  
Each contact is organized by a key, usually name.  And attached to each name is contact information, or the values.
Some contacts might have email address, phone number, home or work address, etc. Other contacts may just be a name and phone number.  This is a very simple example, but understanding this organizational structure will be helpful as you learn to manipulate tables.  

*Here is a dictionary example with 3 keys:*
>**contacts_dictionary = {"name1": ["email", 555-5552, "work info"], 
      "name2": ["email", 555-5554],
      "name3": 555-5555}**
                     
*Here is a dictionary example with a single key-value pair*
**study_group_dictionary = {"john": ["john@email.com", 555-555-5555, "works at LaunchCode headquarters"]}**   

It has a single key, and a list of values. The organization of this structure is called a "Key-Value Pair".
Using the contact list example, the key would be the name of the person and the values would be their contact information.  The key is a single item (the person's name) and the values can be a single item (an email address) or mulitple items (email, phone number, address, work info, etc).
Keys and values can be any data type, but must use correct data type syntax.  The keys do not have to be strings, but they do need to be a single value.  

For more information, you can read more on dictionary objects [here](https://www.w3schools.com/python/python_dictionaries.asp).

#### Aggregation across multiple columns using dictionary functionality

##### Syntax Example:

**age_dictionary={"age":["sum", "max"]}**

We are creating a new dictionary (**age_dictionary**).  The key is **age** and the values we want are **"sum""** and **"max"**.  This dictionary object has now become a template for the aggregations we want to perform.  However, on it's own, it does nothing.  Once passed to the **agg()** method, it will pick out the specific location of data we want to examine, making a subset table.

The code is contained in the box below.  Run it and see what happens.


For syntax examples, review [this webpage](https://www.geeksforgeeks.org/python-pandas-dataframe-aggregate/).
#### <span style="color:coral;"> - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - </span>

In [ ]:
# Predict the table output before you uncomment the code below.
#It will give us a table with sum and max value of the age

age_dictionary={"age":["sum", "max"]}
dictionary_agg=data.agg(age_dictionary)
dictionary_agg

          age
sum  21205.17
max     80.00

1. What if we want to look at more than one column at a time?  We pass more dictionaries to the agg function.
1. Create a variable to hold at least 3 columns.  Use the syntax from the "Syntax Example" as a guide.
    - Aggregate the following:  survived: "sum" & "count"; age: "std" & "min", and sibsp: "count" & "sum"

In [200]:
# Code your dictionary here:
data.aggregate({"survived":['sum', 'count'],
                "age": ['std', 'min'],
                "sibsp": ['count','sum']})

       survived        age  sibsp
sum       342.0        NaN  466.0
count     891.0        NaN  891.0
std         NaN  14.526497    NaN
min         NaN   0.420000    NaN

### 3. Groupby and Basic Math <span style="color:dodgerblue;"> - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - </span> 

1. Groupby "pclass".  Make sure you use a variable to hold your grouped data.

In [204]:
# <WARNING> For this section, you will need to filter out non-numeric data to run the aggregations
# The line below creates a new dataframe with only numeric columns to avoid warnings
num_only_data = data.select_dtypes(include='number')

# Code your groupby here using num_only_data:
grouped_pclass = num_only_data.groupby('pclass')

# Run your table using first() here instead of head():
grouped_pclass.first()

        survived   age  sibsp  parch     fare
pclass
1              1  38.0      1      0  71.2833
2              1  14.0      1      0  30.0708
3              0  22.0      1      0   7.2500

### 4. Groupby and Multiple Aggregations <span style="color:dodgerblue;"> - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - </span>

#### Group with a List<span style="color:dodgerblue;"> - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - </span>

1. We want to do muliple aggregation functions to our newly grouped data set.  We created a variable to hold a list of functions we want to perform.  These functions are part of the agg method.  When we pass our list to the method, the method will iterate through each item and perform that function for the entire table.

In [205]:
# our list of functions
agg_func_list = ['sum', 'mean', 'median', 'min', 'max', 'std', 'var', 'first', 'last', 'count']


#Apply the agg method to our passenger_class variable (made in the Groupby Basic Math section).  
# Pass our list to the function and run your table.
grouped_pclass.agg(agg_func_list)

       survived                                                                \
            sum      mean median min max       std       var first last count
pclass
1           136  0.629630    1.0   0   1  0.484026  0.234281     1    1   216
2            87  0.472826    0.0   0   1  0.500623  0.250624     1    0   184
3           119  0.242363    0.0   0   1  0.428949  0.183998     0    0   491

        ...        fare                                                \
        ...         sum       mean   median  min       max        std
pclass  ...
1       ...  18177.4125  84.154687  60.2875  0.0  512.3292  78.380373
2       ...   3801.8417  20.662183  14.2500  0.0   73.5000  13.417399
3       ...   6714.6951  13.675550   8.0500  0.0   69.5500  11.778142


                var    first   last count
pclass
1       6143.482816  71.2833  30.00   216
2        180.026589  30.0708  13.00   184
3        138.724622   7.2500   7.75   491

[3 rows x 50 columns]

#### Group with a Dictionary<span style="color:dodgerblue;"> - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - </span>

Using only a list provides us with the entire table.  What if we only want to look at age vs pclass?  

we can create a dictionary to hold the age column for us.  The *key* would be the name of our column, and the values our list of functions to perform on that column.  The code would look like this:

In [207]:
agg_func_dict = {
    'age':
    ['sum', 'mean', 'median', 'min', 'max', 'std', 'var', 'first', 'last', 'count']
}
# We would run our table like this:
#passenger_class.agg(agg_func_dict)

Looking at the *age_func_dict* syntax, create a dictionary variable for the "survived" column and pass it to **passenger_class.agg()** in the box below.

In [208]:
# Code it here:
sruvived_dictionary = {
    'survived':
    ['sum', 'mean', 'median', 'min', 'max', 'std', 'var', 'first', 'last', 'count']
}

grouped_pclass.agg(sruvived_dictionary)

       survived
            sum      mean median min max       std       var first last count
pclass
1           136  0.629630    1.0   0   1  0.484026  0.234281     1    1   216
2            87  0.472826    0.0   0   1  0.500623  0.250624     1    0   184
3           119  0.242363    0.0   0   1  0.428949  0.183998     0    0   491

<span style="background-color:dodgerblue; color:dodgerblue;">- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -</span>

# B. Recoding and Creating New Values and Variables 

1. Work through the Part B, there are 3 sections

### Create a New Column <span style="color:dodgerblue;"> - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - </span>

In the box below:
1. Create a new column by manipulating the values of an existing column.  Specifically, create a new column, "fare_2021" that allows us to compare the cost of fare in pounds back in 1912 to 2021.  The inflation multiplier from 1912 to 2021 is approximately 117.17.

In [209]:
# Code your new "fare_2021" column here:
data["fare_2021"] = data["fare"] * 117.17

# Run the head of your table to see your new column:
data.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone,fare_2021
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False,849.482500
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False,8352.264261
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True,928.572250
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False,6221.727000
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True,943.218500

### Replacing Values <span style="color:dodgerblue;"> - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - </span> 
 
Replace the string-based "yes","no" values in the "alive" column using booleans, replacing "yes" values with True and "no" values with False.

In [212]:
# Code your updated values here:
data["alive"] = data["alive"].replace(to_replace={"yes": True, "no": False})

data.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone,fare_2021
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,False,False,849.482500
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,True,False,8352.264261
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,True,True,928.572250
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,True,False,6221.727000
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,False,True,943.218500

We can also use functions to update values.

1. Create a function that will convert the string-based "alive" values of "yes" or "no" to a boolean value of True or False. Apply it to your table and run your table here:

In [214]:
# Code your function here:
def survivors(data):
    alive =data['alive']

    if alive == "yes":
        return True
    else:
        return False 
    
data["survivors"] = data.apply(survivors, axis=1)

print(data["survivors"].value_counts())

survivors
False    891
Name: count, dtype: int64

### Using a function to create a new column <span style="color:dodgerblue;"> - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - </span> 

Sometimes you might want to create a new column based on combining multiple columns together.

1. create an "age_group" column that breaks years up as 0-19, 20-29, 30-39, etc until all given ages are covered.  Make sure you check to see where you can stop counting by 10s.

In [216]:
# Write your max age check here:
max_age = data["age"].max()
print(max_age)

80.0

In [220]:
# Code the new "age_group" column function here:
bins = [0, 20, 30, 40, 50, 60, 70, 80, 90]
labels = ["0-19", "20-29", "30-39", "40-49", "50-59", "60-69", "70-79", "80-89"]
data["age_group"] = pd.cut(
    data["age"],
    bins=bins,
    right= False,
    labels=labels
)

print(data[["age", "age_group"]].head())

    age age_group
0  22.0     20-29
1  38.0     30-39
2  26.0     20-29
3  35.0     30-39
4  35.0     30-39

<span style="background-color:dodgerblue; color:dodgerblue;">- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -</span>

# C. Reshaping Tables

1. Work through Part C, there are 4 sections

### Sort_values <span style="color:dodgerblue;"> - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - </span>

Use **sort_values()** to answer the following question:
> What is the age of the person who paid the highest fare?

Hint: We want to see the highest fare value first. To find this, should we set the sort order to ascending or descending?  Check the [documentation](https://pandas.pydata.org/docs/reference/api/pandas.DataFrame.sort_values.html?highlight=sort_values#pandas.DataFrame.sort_values) for the syntax.

In [227]:
# Code your sort_values here:
data.sort_values(by=["fare", "age"], ascending= False)

# Run your table here:
print(data.sort_values(by=["fare", "age"], ascending= False))

     survived  pclass     sex   age  sibsp  parch      fare embarked   class  \
679         1       1    male  36.0      0      1  512.3292        C   First
258         1       1  female  35.0      0      0  512.3292        C   First
737         1       1    male  35.0      0      0  512.3292        C   First
438         0       1    male  64.0      1      4  263.0000        S   First
341         1       1  female  24.0      3      2  263.0000        S   First
..        ...     ...     ...   ...    ...    ...       ...      ...     ...
481         0       2    male   NaN      0      0    0.0000        S  Second
633         0       1    male   NaN      0      0    0.0000        S   First
674         0       2    male   NaN      0      0    0.0000        S  Second
732         0       2    male   NaN      0      0    0.0000        S  Second
815         0       1    male   NaN      0      0    0.0000        S   First

       who  adult_male deck  embark_town  alive  alone     fare_2021  \
679    man        True    B    Cherbourg   True  False  60029.612364
258  woman       False  NaN    Cherbourg   True   True  60029.612364
737    man        True    B    Cherbourg   True   True  60029.612364
438    man        True    C  Southampton  False  False  30815.710000
341  woman       False    C  Southampton   True  False  30815.710000
..     ...         ...  ...          ...    ...    ...           ...
481    man        True  NaN  Southampton  False   True      0.000000
633    man        True  NaN  Southampton  False   True      0.000000
674    man        True  NaN  Southampton  False   True      0.000000
732    man        True  NaN  Southampton  False   True      0.000000
815    man        True    B  Southampton  False   True      0.000000

     survivors age_group
679      False     30-39
258      False     30-39
737      False     30-39
438      False     60-69
341      False     20-29
..         ...       ...
481      False       NaN
633      False       NaN
674      False       NaN
732      False       NaN
815      False       NaN

[891 rows x 18 columns]

### pivot_table <span style="color:dodgerblue;"> - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - </span> 
1. pivot the table of the summed data where the values are "fare", index is "who" and "age_group", and the columns are "survived"

Hint: set the aggfunc parameter to np.sum

In [232]:
# Code your pivot_table here:
pivot_table = data.pivot_table(
    values="fare", 
    aggfunc= "sum", 
    index= ["who", "age_group"]
 )

# Run your table here:
print(pivot_table)

                      fare
who   age_group
child 0-19       2721.2210
      20-29         0.0000
      30-39         0.0000
      40-49         0.0000
      50-59         0.0000
      60-69         0.0000
      70-79         0.0000
      80-89         0.0000
man   0-19       1123.9582
      20-29      3082.1871
      30-39      3227.2248
      40-49      1577.3167
      50-59      1079.5042
      60-69       676.1875
      70-79       181.1834
      80-89        30.0000
woman 0-19       1369.1584
      20-29      2919.1791
      30-39      3515.7833
      40-49      1804.8877
      50-59      1221.2958
      60-69       242.7958
      70-79         0.0000
      80-89         0.0000

C:\Users\adrir\AppData\Local\Temp\ipykernel_27656\1885120990.py:2: FutureWarning: The default value of observed=False is deprecated and will change to observed=True in a future version of pandas. Specify observed=False to silence this warning and retain the current behavior
  pivot_table = data.pivot_table(

### Wide to Long <span style="color:dodgerblue;"> - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - </span> 

1. Create a table where the columns are "who" and the values are "pclass"
1. Answer the question:  How does this table differ from the pivot_table above?  Specifically, how is "who" different?

In [ ]:
# Code your table here:
table = pd.crosstab(data["pclass"], data["who"])

# Run your table here:
print(table)

# Answer the question here:
# The pivot table shows information in a little bit more detail, we can see the division per who and per group of age. In the second table,
#we can only see the general division per who, but not per age group

who     child  man  woman
pclass
1           6  119     91
2          19   99     66
3          58  319    114

### Melt <span style="color:dodgerblue;"> - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - </span>

1.  What does the **melt** function do to the data?

In [235]:
# What does melt do?
long_table = table.reset_index().melt(
    id_vars="pclass", 
    var_name="who",
    value_name="count"
)

print(long_table)

   pclass    who  count
0       1  child      6
1       2  child     19
2       3  child     58
3       1    man    119
4       2    man     99
5       3    man    319
6       1  woman     91
7       2  woman     66
8       3  woman    114

2.  With a new variable, apply a default melt to your data.

In [237]:
# Create your default melt table here with the following syntax:  new_name = pd.melt(data_set)
new_name = pd.melt(
    data,
    id_vars=["pclass"],
    var_name="category",
    value_name="count"
)
# Run your table here:
print(new_name)
# Check the shape of your new table.

       pclass   category  count
0           3   survived      0
1           1   survived      1
2           3   survived      1
3           1   survived      1
4           3   survived      0
...       ...        ...    ...
15142       2  age_group  20-29
15143       1  age_group   0-19
15144       3  age_group    NaN
15145       1  age_group  20-29
15146       3  age_group  30-39

[15147 rows x 3 columns]

3. Create a melt table where the index variables are "embarked", and the values are "fare" and "deck"

In [240]:
# Create your melt table here:
melt_2 = pd.melt(
    data, 
    id_vars="embarked",
    value_vars=["fare", "deck"],
    var_name="fare/deck",
    value_name="count"
)
# Run your table here:
print(melt_2)
# Check the shape

     embarked fare/deck    count
0           S      fare     7.25
1           C      fare  71.2833
2           S      fare    7.925
3           S      fare     53.1
4           S      fare     8.05
...       ...       ...      ...
1777        S      deck      NaN
1778        S      deck        B
1779        S      deck      NaN
1780        C      deck        C
1781        Q      deck      NaN

[1782 rows x 3 columns]

# Optonal Challenges:

1. Clean and Explore the table.  
    1. How would you handle any missing data?
    1. Would you keep all of the columns?
    1. Would you want to manipulate any data?